#+title: Wnioskowanie w warunkach niepewności
#+subtitle: Piosenki i ich parametry
#+author: Patryk Gronkiewicz 164157
#+language: pl
#+options: toc:nil num:t todo:nil tags:nil
#+startup: beamer latexpreview
#+beamer_theme: Luebeck
#+beamer_color_theme: structure
#+beamer_font_theme: professionalfonts
#+latex_class: beamer
#+latex_class_options: [presentation]
#+property: header-args:R  :session *R* :eval never-export :tangle ./source.R :exports both

* Wczytanie danych
#+begin_src R :exports none :eval never
options(menu.graphics = FALSE)
if (!requireNamespace("BiocManager", quietly = TRUE))
  install.packages("BiocManager")
BiocManager::install()
BiocManager::install(c("graph", "Rgraphviz"))
setRepositories()
2
install.packages("gRain", dependencies=TRUE);
install.packages("bnlearn")
#+end_src

#+begin_src R
library(bnlearn)
df <- data.frame(read.csv("./songs_normalize.csv"))
colnames(df)
head(df[c("artist",  "song", "genre")], 3)
#+end_src

#+RESULTS:
| Britney Spears | Oops!...I Did It Again | pop          |
| blink-182      | All The Small Things   | rock, pop    |
| Faith Hill     | Breathe                | pop, country |

* Zamiana gatunków na factory
#+begin_src R
library(stringr)
library(forcats)
one_gen <- function(entry)
  str_split(entry, ", ")[[1]][1]
df$genre <- as_factor(sapply(c(df$genre), one_gen))
df$explicit <- df$explicit == "True"
head(df[c("artist",  "song", "genre")], 3)
#+end_src

#+RESULTS:
| Britney Spears | Oops!...I Did It Again | pop  |
| blink-182      | All The Small Things   | rock |
| Faith Hill     | Breathe                | pop  |
* Porównanie $\log{\mathrm{instrumentalness}}$
#+attr_latex: :width 0.7\textwidth
[[./hists.pdf]]
#+begin_src R :exports none :results nil
pdf("hists.pdf")
par(mfrow = c(2, 1))
hist(df$instrumentalness)
hist(log(df$instrumentalness))
a <- dev.off()
par(mfrow = c(1, 1))
#+end_src

#+RESULTS:
| 1 |
| 1 |

* Przygotowanie do dyskretyzacji
Większość danych ma charakter ciągły, w związku z tym należało je zdyskretyzować.
Część danych należało przetworzyć:
+ Wyłączyć artystów i tytuły z czynników
+ Skonwertować liczby całkowite do zmiennoprzecinkowych
+ W przypadku instrumentalności zlogarytmować i usunąć nieskończoności.
#+begin_src R :results nil :exports source
df <- subset(df, select = -c(artist, song))
df$duration_ms <- df$duration_ms/1.0
df$popularity <- df$popularity/1.0
head(df, 3)
#+end_src

#+RESULTS:
| 211160 | FALSE | 2000 | 77 | 0.751 | 0.834 | 1 | -5.444 | 0 | 0.0437 |    0.3 | 1.77e-05 | 0.355 | 0.894 |  95.053 | pop  |
| 167066 | FALSE | 1999 | 79 | 0.434 | 0.897 | 0 | -4.918 | 1 | 0.0488 | 0.0103 |        0 | 0.612 | 0.684 | 148.726 | rock |
| 250546 | FALSE | 1999 | 66 | 0.529 | 0.496 | 7 | -9.007 | 1 |  0.029 |  0.173 |        0 | 0.251 | 0.278 | 136.859 | pop  |

